Revit 2024 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainBothUandV Property
 A chain formed by these curve elements is trying to be both U- and V- splitter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedSurfaceCurveChainBothUandV { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceCurveChainBothUandV As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainBothUandV {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace